	IDENTIFICATION DIVISION.
	PROGRAM-ID. IDEONE.

	ENVIRONMENT DIVISION.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-NUM PIC 99999.
	01 WS-QUO PIC 99999.
	01 WS-R PIC 99999.
	01 WS-REV PIC 99999.
	01 WS-REV2 PIC 99999.
	01 WS-REV3 PIC 99999.
	01 WS-C PIC 99999.
	01 WS-COUNT PIC 99999.
	01 WS-FILE-RECORD PIC X(30).
	01 WS-REC1 PIC 99999.
	01 WS-REC2 PIC 99999.
	01 WS-ZS1 PIC ZZZZ9.
	01 WS-SPACE PIC X(20).
	01 WS-ANSWER PIC X(20).
	
	PROCEDURE DIVISION.
	*>	your code goes herE
		ACCEPT WS-COUNT.
	PARA-START.
		MOVE 0 TO WS-REV.
		MOVE 0 TO WS-REV2.
		MOVE 0 TO WS-REV3.
		MOVE 0 TO WS-ZS1.
		ACCEPT WS-FILE-RECORD.
		UNSTRING WS-FILE-RECORD DELIMITED BY SPACE
      		INTO WS-REC1
           	WS-REC2
  		END-UNSTRING.
	PARA-0.
		MOVE WS-REC1 TO WS-NUM.
	PARA-1.
		IF WS-NUM=0 THEN
			GO TO PARA-2
		ELSE 
			DIVIDE WS-NUM BY 10 GIVING WS-NUM REMAINDER WS-R
			END-DIVIDE
			COMPUTE WS-REV=WS-REV * 10 + WS-R END-COMPUTE
			ADD 1 TO WS-C END-ADD
			GO TO PARA-1
		END-IF.
	PARA-2.
		GO TO PARA-00.
	PARA-00.
		MOVE WS-REC2 TO WS-NUM.
	PARA-10.
		IF WS-NUM=0 THEN
			GO TO PARA-20
		ELSE 
			DIVIDE WS-NUM BY 10 GIVING WS-NUM REMAINDER WS-R
			END-DIVIDE
			COMPUTE WS-REV2=WS-REV2 * 10 + WS-R END-COMPUTE
			ADD 1 TO WS-C END-ADD
			GO TO PARA-10
		END-IF.
	PARA-20.
		GO TO PARA-ADD.
		
	PARA-ADD.
		ADD WS-REV TO WS-REV2 END-ADD.
	
	PARA-01.
		MOVE WS-REV2 TO WS-NUM.
	PARA-11.
		IF WS-NUM=0 THEN
			GO TO PARA-21
		ELSE 
			DIVIDE WS-NUM BY 10 GIVING WS-NUM REMAINDER WS-R
			END-DIVIDE
			COMPUTE WS-REV3=WS-REV3 * 10 + WS-R END-COMPUTE
			ADD 1 TO WS-C END-ADD
			GO TO PARA-11
		END-IF.
	PARA-21.
		MOVE WS-REV3 TO WS-ZS1
		UNSTRING WS-ZS1 DELIMITED BY ALL SPACES INTO    
         WS-SPACE,WS-ANSWER
		DISPLAY WS-ANSWER
		IF WS-COUNT > 1 THEN
			SUBTRACT 1 FROM WS-COUNT END-SUBTRACT
			GO TO PARA-START
		END-IF.
		STOP RUN.
