	IDENTIFICATION DIVISION.
	PROGRAM-ID. IDEONE.

	ENVIRONMENT DIVISION.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-NUM1 PIC Z9.
	PROCEDURE DIVISION.
	*>	your code goes here
		A-PARA.
			ACCEPT WS-NUM1.
			
			IF WS-NUM1=42 THEN
   			STOP RUN
   			ELSE
   			DISPLAY WS-NUM1
   			GO TO A-PARA
   			END-IF.
   			STOP RUN.
